shelly-tang/YareLampGo_esp32/led_serial.cpp
// SPDX-FileCopyrightText: 2026 @ninsmiracle, @shelly-tang, and LampGo contributors
// SPDX-License-Identifier: GPL-3.0-only

#include "led_serial.h"
#include "display_link.h"

#include <Arduino.h>
#include <ctype.h>
#include <esp_heap_caps.h>
#include <esp32-hal-rmt.h>
#include <esp_system.h>
#include <string.h>
#include <freertos/FreeRTOS.h>
#include <freertos/semphr.h>
#include <freertos/task.h>

#ifndef LAMPGO_LED_PIXEL_PIN
#define LAMPGO_LED_PIXEL_PIN D2
#endif

#ifndef LAMPGO_LED_PANEL_PIXELS
#define LAMPGO_LED_PANEL_PIXELS 447
#endif

#ifndef LAMPGO_LED_PANEL_COUNT
#define LAMPGO_LED_PANEL_COUNT 1
#endif

#define LAMPGO_LED_PIXEL_COUNT (LAMPGO_LED_PANEL_PIXELS * LAMPGO_LED_PANEL_COUNT)

#ifndef LAMPGO_LED_TASK_STACK
#define LAMPGO_LED_TASK_STACK 4096
#endif

namespace {

constexpr int kPanelRows = 9;
constexpr int kCombinedCols = 51;
constexpr int kMaxMode = 33;
constexpr int kPatternRows = 8;
constexpr int kPatternCols = 16;
constexpr int kIrregularRowCount = 9;
constexpr int kIrregularMaxCols = 51;

const int kIrregularRowLengths[kIrregularRowCount] = {47, 49, 51, 51, 51, 51, 51, 49, 47};
const int kIrregularRowStarts[kIrregularRowCount] = {0, 47, 96, 147, 198, 249, 300, 351, 400};

SemaphoreHandle_t g_mutex = nullptr;
TaskHandle_t g_task = nullptr;
bool g_ready = false;
bool g_outputStarted = false;
bool g_rmtReady = false;
bool g_lastShowOk = false;
bool g_useEllipseMask = false;
int g_mode = 0;
int g_brightness = 64;
uint32_t g_lastWriteMs = 0;
uint32_t g_animFrame = 0;
uint32_t g_lastFrameMs = 0;
uint32_t g_modeStartedMs = 0;
char g_lastCommand[32] = "";
uint8_t g_pixels[LAMPGO_LED_PIXEL_COUNT * 3] = {0};
rmt_data_t *g_rmtData = nullptr;

bool g_clipActive = false;
char g_clipId[40] = "";
uint16_t g_clipFrameCount = 0;
uint16_t g_clipFps = 0;
uint32_t g_clipFrame = 0;
uint32_t g_clipLastFrameMs = 0;
char g_effectTemplate[16] = "";
char g_effectVariant[16] = "";
char g_effectDirection[8] = "right";
uint8_t g_effectRed = 255;
uint8_t g_effectGreen = 255;
uint8_t g_effectBlue = 255;
uint8_t g_effectSecondaryRed = 255;
uint8_t g_effectSecondaryGreen = 45;
uint8_t g_effectSecondaryBlue = 125;
uint8_t g_effectIntensityPercent = 100;
bool g_expressionLoop = true;
uint32_t g_expressionEndMs = 0;

bool g_focusEyesOpen = true;
uint8_t g_focusBlinksRemaining = 0;
uint32_t g_focusNextTransitionMs = 0;

const char *const kModeNames[kMaxMode + 1] = {
    "off",
    "red",
    "green",
    "blue",
    "white",
    "theater",
    "theaterred",
    "theatergreen",
    "theaterblue",
    "rainbow",
    "rainbowchase",
    "left",
    "right",
    "up",
    "down",
    "check",
    "cross",
    "exclaim",
    "question",
    "star",
    "music",
    "smiley",
    "sad",
    "heart",
    "surprised",
    "blush",
    "angry",
    "thinking",
    "sleep",
    "helpless",
    "cool",
    "focused",
    "wink",
    "myu7gt",
};

const uint8_t kCheckPattern[8][8] = {
    {0, 0, 0, 0, 0, 0, 0, 1},
    {0, 0, 0, 0, 0, 0, 1, 1},
    {0, 0, 0, 0, 0, 1, 1, 0},
    {1, 0, 0, 0, 1, 1, 0, 0},
    {1, 1, 0, 1, 1, 0, 0, 0},
    {0, 1, 1, 1, 0, 0, 0, 0},
    {0, 0, 1, 0, 0, 0, 0, 0},
    {0, 0, 0, 0, 0, 0, 0, 0},
};

const uint8_t kCrossPattern[8][8] = {
    {1, 0, 0, 0, 0, 0, 0, 1},
    {1, 1, 0, 0, 0, 0, 1, 1},
    {0, 1, 1, 0, 0, 1, 1, 0},
    {0, 0, 1, 1, 1, 1, 0, 0},
    {0, 0, 1, 1, 1, 1, 0, 0},
    {0, 1, 1, 0, 0, 1, 1, 0},
    {1, 1, 0, 0, 0, 0, 1, 1},
    {1, 0, 0, 0, 0, 0, 0, 1},
};

const uint8_t kExclaimPattern[8][8] = {
    {0, 0, 0, 1, 1, 0, 0, 0},
    {0, 0, 0, 1, 1, 0, 0, 0},
    {0, 0, 0, 1, 1, 0, 0, 0},
    {0, 0, 0, 1, 1, 0, 0, 0},
    {0, 0, 0, 1, 1, 0, 0, 0},
    {0, 0, 0, 0, 0, 0, 0, 0},
    {0, 0, 0, 1, 1, 0, 0, 0},
    {0, 0, 0, 1, 1, 0, 0, 0},
};

const uint8_t kQuestionPattern[8][8] = {
    {0, 0, 1, 1, 1, 1, 0, 0},
    {0, 1, 1, 0, 0, 1, 1, 0},
    {0, 0, 0, 0, 0, 1, 1, 0},
    {0, 0, 0, 0, 1, 1, 0, 0},
    {0, 0, 0, 1, 1, 0, 0, 0},
    {0, 0, 0, 0, 0, 0, 0, 0},
    {0, 0, 0, 1, 1, 0, 0, 0},
    {0, 0, 0, 1, 1, 0, 0, 0},
};

const uint8_t kStarPattern[8][8] = {
    {0, 0, 0, 0, 1, 0, 0, 0},
    {0, 0, 0, 0, 1, 0, 0, 0},
    {0, 0, 0, 1, 1, 0, 0, 0},
    {1, 1, 1, 1, 1, 1, 1, 0},
    {0, 1, 1, 1, 1, 1, 1, 1},
    {0, 0, 0, 1, 1, 0, 0, 0},
    {0, 0, 0, 1, 0, 0, 0, 0},
    {0, 0, 0, 1, 0, 0, 0, 0},
};

const uint8_t kMusicNote[8][8] = {
    {0, 0, 0, 0, 1, 1, 1, 0},
    {0, 0, 0, 0, 1, 0, 1, 1},
    {0, 0, 0, 0, 1, 0, 0, 0},
    {0, 0, 0, 0, 1, 0, 0, 0},
    {0, 0, 0, 0, 1, 0, 0, 0},
    {0, 1, 1, 0, 1, 0, 0, 0},
    {1, 1, 1, 1, 0, 0, 0, 0},
    {0, 1, 1, 0, 0, 0, 0, 0},
};

const uint8_t kCirclePattern[8][8] = {
    {0, 0, 1, 1, 1, 1, 0, 0},
    {0, 1, 0, 0, 0, 0, 1, 0},
    {1, 0, 0, 0, 0, 0, 0, 1},
    {1, 0, 0, 0, 0, 0, 0, 1},
    {1, 0, 0, 0, 0, 0, 0, 1},
    {1, 0, 0, 0, 0, 0, 0, 1},
    {0, 1, 0, 0, 0, 0, 1, 0},
    {0, 0, 1, 1, 1, 1, 0, 0},
};

const uint8_t kHeartPattern[8][8] = {
    {0, 1, 1, 0, 0, 1, 1, 0},
    {1, 1, 1, 1, 1, 1, 1, 1},
    {1, 1, 1, 1, 1, 1, 1, 1},
    {1, 1, 1, 1, 1, 1, 1, 1},
    {0, 1, 1, 1, 1, 1, 1, 0},
    {0, 0, 1, 1, 1, 1, 0, 0},
    {0, 0, 0, 1, 1, 0, 0, 0},
    {0, 0, 0, 0, 0, 0, 0, 0},
};

const uint8_t kCombinedPatterns[][8][16] = {
    {
        {0,0,0,0,0,0,0,0, 0,0,0,0,0,0,0,0},
        {0,0,0,1,1,0,0,0, 0,0,0,1,1,0,0,0},
        {0,0,1,1,1,1,0,0, 0,0,1,1,1,1,0,0},
        {0,1,1,0,0,1,1,0, 0,1,1,0,0,1,1,0},
        {0,1,0,0,0,0,1,0, 0,1,0,0,0,0,1,0},
        {0,0,0,0,0,0,0,0, 0,0,0,0,0,0,0,0},
        {0,0,0,0,0,0,0,0, 0,0,0,0,0,0,0,0},
        {0,0,0,0,0,0,0,0, 0,0,0,0,0,0,0,0},
    },
    {
        {1,0,0,0,0,0,0,0, 0,0,0,0,0,0,0,1},
        {0,1,0,0,0,0,0,0, 0,0,0,0,0,0,1,0},
        {0,0,1,0,0,0,0,0, 0,0,0,0,0,1,0,0},
        {0,0,0,1,0,0,0,0, 0,0,0,0,1,0,0,0},
        {0,0,1,1,1,0,0,0, 0,0,0,1,1,1,0,0},
        {0,0,1,1,1,1,0,0, 0,0,1,1,1,1,0,0},
        {0,0,0,1,1,0,0,0, 0,0,0,1,1,0,0,0},
        {0,0,0,0,0,0,0,0, 0,0,0,0,0,0,0,0},
    },
    {
        {0,0,0,0,0,0,0,0, 0,0,0,0,1,0,0,0},
        {0,1,0,1,0,1,0,0, 0,0,0,1,0,0,0,0},
        {0,1,1,1,1,1,0,0, 1,0,1,0,0,0,0,0},
        {0,0,0,0,0,0,0,0, 0,1,0,0,0,0,0,0},
        {0,0,0,1,1,0,0,0, 0,0,0,1,1,0,0,0},
        {0,0,1,1,1,1,0,0, 0,0,1,1,1,1,0,0},
        {0,0,1,1,1,1,0,0, 0,0,1,1,1,1,0,0},
        {0,0,0,1,1,0,0,0, 0,0,0,1,1,0,0,0},
    },
    {
        {0,0,0,0,0,0,0,0, 0,0,0,0,0,0,0,0},
        {0,0,0,1,1,0,0,0, 0,0,0,1,1,0,0,0},
        {0,0,1,1,1,1,0,0, 0,0,1,1,1,1,0,0},
        {0,0,1,1,1,1,0,0, 0,0,1,1,1,1,0,0},
        {0,0,0,1,1,0,0,0, 0,0,0,1,1,0,0,0},
        {0,0,0,0,0,0,0,0, 0,0,0,0,0,0,0,0},
        {2,2,2,0,0,0,0,0, 0,0,0,0,0,2,2,2},
        {2,2,2,0,0,0,0,0, 0,0,0,0,0,2,2,2},
    },
    {
        {0,0,0,0,0,0,0,0, 0,0,0,0,0,0,0,0},
        {0,0,1,1,1,1,0,0, 0,0,1,1,1,1,0,0},
        {0,0,0,0,0,0,0,0, 0,0,0,0,0,0,0,0},
        {0,0,0,0,0,0,0,0, 0,0,0,0,0,0,0,0},
        {0,0,0,0,0,0,0,0, 0,0,0,0,0,0,0,0},
        {0,0,0,0,0,0,0,0, 0,0,0,0,0,0,0,0},
        {0,0,0,0,0,0,0,0, 0,0,0,0,0,0,0,0},
        {0,0,0,0,0,0,0,0, 0,0,0,0,0,0,0,0},
    },
    {
        {0,0,0,0,0,0,0,0, 0,0,0,0,0,0,0,0},
        {0,0,1,1,1,1,0,0, 0,0,1,1,1,1,0,0},
        {0,0,0,0,0,0,0,0, 0,0,0,0,0,0,2,0},
        {0,0,0,0,0,0,0,0, 0,0,0,0,0,0,2,0},
        {0,0,0,0,0,0,0,0, 0,0,0,0,0,2,2,2},
        {0,0,0,0,0,0,0,0, 0,0,0,0,0,2,2,2},
        {0,0,0,0,0,0,0,0, 0,0,0,0,0,0,2,0},
        {0,0,0,0,0,0,0,0, 0,0,0,0,0,0,0,0},
    },
    {
        {0,0,0,0,0,0,0,0, 0,0,0,0,0,0,0,0},
        {0,0,0,1,1,0,0,0, 0,0,0,1,1,0,0,0},
        {0,0,1,1,1,1,0,0, 0,0,1,1,1,1,0,0},
        {0,0,1,1,1,1,0,0, 0,0,1,1,1,1,0,0},
        {0,0,1,1,1,1,0,0, 0,0,1,1,1,1,0,0},
        {0,0,1,1,1,1,0,0, 0,0,1,1,1,1,0,0},
        {0,0,0,1,1,0,0,0, 0,0,0,1,1,0,0,0},
        {0,0,0,0,0,0,0,0, 0,0,0,0,0,0,0,0},
    },
    {
        {0,0,0,0,0,0,0,0, 0,0,0,0,0,0,0,0},
        {0,0,0,0,0,0,0,0, 0,0,0,0,0,0,0,0},
        {0,0,0,0,0,0,0,0, 0,0,0,0,0,0,0,0},
        {0,0,1,1,1,1,0,0, 0,0,1,1,1,1,0,0},
        {0,0,0,0,0,0,0,0, 0,0,0,0,0,0,0,0},
        {0,0,0,0,0,0,0,0, 0,0,0,0,0,0,0,0},
        {0,0,0,0,0,0,0,0, 0,0,0,0,0,0,0,0},
        {0,0,0,0,0,0,0,0, 0,0,0,0,0,0,0,0},
    },
    {
        {0,0,0,0,0,0,0,0, 0,0,0,0,0,0,0,0},
        {0,0,0,0,0,0,0,0, 0,0,0,0,0,0,0,0},
        {0,0,0,1,1,0,0,0, 0,0,0,1,1,0,0,0},
        {0,0,1,1,1,1,0,0, 0,0,1,1,1,1,0,0},
        {0,0,1,1,1,1,0,0, 0,0,1,1,1,1,0,0},
        {0,0,0,1,1,0,0,0, 0,0,0,1,1,0,0,0},
        {0,0,0,0,0,0,0,0, 0,0,0,0,0,0,0,0},
        {0,0,0,0,0,0,0,0, 0,0,0,0,0,0,0,0},
    },
    {
        {0,0,0,0,0,0,0,0, 0,0,0,0,1,0,0,0},
        {0,0,0,0,0,0,0,0, 0,0,0,1,0,0,0,0},
        {0,0,0,1,1,0,0,0, 0,0,0,1,0,0,0,0},
        {0,0,1,1,1,1,0,0, 0,0,1,0,0,0,0,0},
        {0,0,1,1,1,1,0,0, 0,0,1,0,0,0,0,0},
        {0,0,0,1,1,0,0,0, 0,0,0,1,0,0,0,0},
        {0,0,0,0,0,0,0,0, 0,0,0,0,1,0,0,0},
        {0,0,0,0,0,0,0,0, 0,0,0,0,0,0,0,0},
    },
    {
        {0,0,0,0,0,0,0,0, 0,0,0,0,0,0,0,0},
        {0,0,0,0,1,0,0,0, 0,0,0,0,0,0,0,0},
        {0,0,0,1,1,0,0,0, 0,0,0,0,0,0,0,0},
        {0,0,1,1,1,1,1,1, 1,1,1,1,1,0,0,0},
        {0,0,1,1,1,1,1,1, 1,1,1,1,1,0,0,0},
        {0,0,0,1,1,0,0,0, 0,0,0,0,0,0,0,0},
        {0,0,0,0,1,0,0,0, 0,0,0,0,0,0,0,0},
        {0,0,0,0,0,0,0,0, 0,0,0,0,0,0,0,0},
    },
    {
        {0,0,0,0,0,0,0,0, 0,0,0,0,0,0,0,0},
        {0,0,0,0,0,0,0,0, 0,0,0,1,0,0,0,0},
        {0,0,0,0,0,0,0,0, 0,0,0,1,1,0,0,0},
        {0,0,0,1,1,1,1,1, 1,1,1,1,1,1,0,0},
        {0,0,0,1,1,1,1,1, 1,1,1,1,1,1,0,0},
        {0,0,0,0,0,0,0,0, 0,0,0,1,1,0,0,0},
        {0,0,0,0,0,0,0,0, 0,0,0,1,0,0,0,0},
        {0,0,0,0,0,0,0,0, 0,0,0,0,0,0,0,0},
    },
    {
        {0,0,0,0,0,0,0,1, 1,0,0,0,0,0,0,0},
        {0,0,0,0,0,0,1,1, 1,1,0,0,0,0,0,0},
        {0,0,0,0,0,1,1,1, 1,1,1,0,0,0,0,0},
        {0,0,0,0,0,0,0,1, 1,0,0,0,0,0,0,0},
        {0,0,0,0,0,0,0,1, 1,0,0,0,0,0,0,0},
        {0,0,0,0,0,0,0,1, 1,0,0,0,0,0,0,0},
        {0,0,0,0,0,0,0,1, 1,0,0,0,0,0,0,0},
        {0,0,0,0,0,0,0,0, 0,0,0,0,0,0,0,0},
    },
    {
        {0,0,0,0,0,0,0,0, 0,0,0,0,0,0,0,0},
        {0,0,0,0,0,0,0,1, 1,0,0,0,0,0,0,0},
        {0,0,0,0,0,0,0,1, 1,0,0,0,0,0,0,0},
        {0,0,0,0,0,0,0,1, 1,0,0,0,0,0,0,0},
        {0,0,0,0,0,0,0,1, 1,0,0,0,0,0,0,0},
        {0,0,0,0,0,1,1,1, 1,1,1,0,0,0,0,0},
        {0,0,0,0,0,0,1,1, 1,1,0,0,0,0,0,0},
        {0,0,0,0,0,0,0,1, 1,0,0,0,0,0,0,0},
    },
    {
        {0,0,0,0,0,1,1,0, 1,1,0,0,0,0,0,0},
        {0,0,0,0,1,1,1,1, 1,1,1,1,0,0,0,0},
        {0,0,0,1,1,1,1,1, 1,1,1,1,1,0,0,0},
        {0,0,0,1,1,1,1,1, 1,1,1,1,1,0,0,0},
        {0,0,0,0,1,1,1,1, 1,1,1,1,0,0,0,0},
        {0,0,0,0,0,1,1,1, 1,1,1,0,0,0,0,0},
        {0,0,0,0,0,0,1,1, 1,1,0,0,0,0,0,0},
        {0,0,0,0,0,0,0,1, 1,0,0,0,0,0,0,0},
    },
    {
        {0,0,0,0,0,1,1,0, 1,1,0,0,0,0,0,0},
        {0,0,0,0,1,1,1,0, 0,1,1,1,0,0,0,0},
        {0,0,0,1,1,1,1,0, 0,1,1,1,1,0,0,0},
        {0,0,0,1,1,0,0,0, 0,0,0,1,1,0,0,0},
        {0,0,0,0,1,1,1,0, 0,1,1,1,0,0,0,0},
        {0,0,0,0,0,1,1,0, 0,1,1,0,0,0,0,0},
        {0,0,0,0,0,0,1,1, 1,1,0,0,0,0,0,0},
        {0,0,0,0,0,0,0,1, 1,0,0,0,0,0,0,0},
    },
    {
        {0,0,0,0,0,0,0,0, 0,0,0,0,0,0,0,0},
        {0,0,0,0,0,0,0,0, 0,0,0,0,0,0,0,0},
        {0,0,0,0,0,1,0,0, 0,0,1,0,0,0,0,0},
        {0,0,0,0,1,1,0,0, 0,0,1,1,0,0,0,0},
        {0,0,0,1,1,1,0,0, 0,0,1,1,1,0,0,0},
        {0,0,1,1,1,1,0,0, 0,0,1,1,1,1,0,0},
        {0,0,0,1,1,0,0,0, 0,0,0,1,1,0,0,0},
        {0,0,0,0,0,0,0,0, 0,0,0,0,0,0,0,0},
    },
    {
        {0,0,0,0,0,0,0,0, 0,0,0,0,0,0,0,0},
        {0,0,0,0,0,0,0,0, 0,0,1,1,1,0,0,0},
        {0,0,0,0,0,0,0,0, 0,0,0,1,0,0,0,0},
        {0,0,0,0,0,0,0,0, 0,0,1,1,1,0,0,0},
        {0,0,0,0,0,0,0,0, 0,0,0,0,0,0,0,0},
        {0,1,1,1,1,0,0,0, 1,1,1,1,0,0,0,0},
        {0,1,1,1,1,0,0,0, 1,1,1,1,0,0,0,0},
        {0,0,0,0,0,0,0,0, 0,0,0,0,0,0,0,0},
    },
    {
        {0,0,0,0,0,0,0,0, 0,0,0,0,1,1,1,1},
        {0,0,0,0,0,0,0,0, 0,0,0,0,0,0,1,0},
        {0,0,0,0,0,0,0,0, 0,0,0,0,0,1,0,0},
        {0,0,0,0,0,0,0,0, 0,0,0,0,1,1,1,1},
        {0,0,0,0,0,0,0,0, 0,0,0,0,0,0,0,0},
        {0,1,1,1,1,0,0,0, 1,1,1,1,0,0,0,0},
        {0,1,1,1,1,0,0,0, 1,1,1,1,0,0,0,0},
        {0,0,0,0,0,0,0,0, 0,0,0,0,0,0,0,0},
    },
    {
        {0,0,0,0,0,0,0,0, 0,0,0,0,0,0,0,0},
        {0,0,0,0,0,0,0,0, 0,0,0,0,0,0,0,0},
        {0,0,0,1,1,0,0,0, 0,0,0,1,1,0,0,0},
        {0,0,1,1,1,1,0,0, 0,0,1,1,1,1,0,0},
        {0,0,1,1,1,1,0,0, 0,0,1,1,1,1,0,0},
        {0,0,0,1,1,0,0,0, 0,0,0,1,1,0,0,0},
        {0,0,0,0,0,0,0,0, 0,0,0,0,0,0,0,0},
        {0,0,0,0,0,0,0,0, 0,0,0,0,0,0,0,0},
    },
    {
        {0,0,0,0,0,0,0,0, 0,0,0,0,0,0,0,0},
        {0,0,0,1,1,0,0,0, 0,0,0,1,1,0,0,0},
        {0,0,1,1,1,1,0,0, 0,0,1,1,1,1,0,0},
        {0,0,1,1,1,1,0,0, 0,0,1,1,1,1,0,0},
        {0,0,1,1,1,1,0,0, 0,0,1,1,1,1,0,0},
        {0,0,1,1,1,1,0,0, 0,0,1,1,1,1,0,0},
        {0,0,0,1,1,0,0,0, 0,0,0,1,1,0,0,0},
        {0,0,0,0,0,0,0,0, 0,0,0,0,0,0,0,0},
    },
    {
        {0,0,0,1,1,0,0,0, 0,0,0,1,1,0,0,0},
        {0,0,1,1,1,1,0,0, 0,0,1,1,1,1,0,0},
        {0,0,1,1,1,1,0,0, 0,0,1,1,1,1,0,0},
        {0,0,1,1,1,1,0,0, 0,0,1,1,1,1,0,0},
        {0,0,1,1,1,1,0,0, 0,0,1,1,1,1,0,0},
        {0,0,1,1,1,1,0,0, 0,0,1,1,1,1,0,0},
        {0,0,1,1,1,1,0,0, 0,0,1,1,1,1,0,0},
        {0,0,0,1,1,0,0,0, 0,0,0,1,1,0,0,0},
    },
    {
        {0,0,0,0,0,0,0,0, 0,0,0,0,0,0,0,0},
        {1,0,1,0,0,1,1,1, 0,2,2,2,2,0,0,0},
        {1,0,1,0,0,0,0,1, 0,2,0,0,0,2,2,2},
        {1,1,1,0,0,0,0,1, 0,2,0,2,2,0,2,0},
        {0,1,0,1,0,1,0,1, 0,2,0,0,2,0,2,0},
        {0,1,0,1,0,1,0,1, 0,2,2,2,2,0,2,0},
        {0,1,0,1,1,1,0,1, 0,0,0,0,0,0,0,0},
        {0,0,0,0,0,0,0,0, 0,0,0,0,0,0,0,0},
    },
};

struct ModeAlias {
  const char *name;
  int mode;
};

const ModeAlias kAliases[] = {
    {"off", 0},
    {"red", 1}, {"green", 2}, {"blue", 3}, {"white", 4},
    {"theater", 5},
    {"theaterred", 6},
    {"theatergreen", 7},
    {"theaterblue", 8},
    {"rainbow", 9},
    {"rainbowchase", 10},
    {"left", 11}, {"right", 12}, {"up", 13}, {"down", 14},
    {"check", 15},
    {"cross", 16},
    {"exclaim", 17},
    {"question", 18},
    {"star", 19},
    {"music", 20},
    {"smiley", 21},
    {"sad", 22},
    {"heart", 23},
    {"surprised", 24},
    {"blush", 25},
    {"angry", 26},
    {"thinking", 27},
    {"sleep", 28},
    {"helpless", 29},
    {"cool", 30},
    {"focused", 31},
    {"wink", 32},
    {"myu7gt", 33},
    {"myu7", 33},
    {"mgt", 33},
    {"yu7gt", 33},
    {"yu7", 33},
};

void normalizeKey(const char *input, char *out, size_t outLen) {
  if (!out || outLen == 0) return;
  out[0] = 0;
  if (!input) return;

  size_t n = 0;
  for (const char *p = input; *p && n + 1 < outLen; ++p) {
    unsigned char c = (unsigned char)*p;
    if (isalnum(c)) {
      out[n++] = (char)tolower(c);
    }
  }
  out[n] = 0;
}

int resolveNormalizedKey(const char *key) {
  if (!key || !key[0]) return -1;

  char *end = nullptr;
  long numeric = strtol(key, &end, 10);
  if (end && *end == 0 && numeric >= 0 && numeric <= kMaxMode) {
    return (int)numeric;
  }

  for (const auto &alias : kAliases) {
    if (strcmp(key, alias.name) == 0) {
      return alias.mode;
    }
  }
  return -1;
}

uint32_t color(uint8_t r, uint8_t g, uint8_t b) {
  return ((uint32_t)r << 16) | ((uint32_t)g << 8) | b;
}

